{
  "generatedAt": "2026-02-16T01:19:45.113Z",
  "categories": [
    {
      "id": "CHRONOS",
      "name": "Chronos",
      "description": "Time-keeping and time-announcing automata. These robots exist to mark, measure, or signal the passage of time through movement, sound, or visual indication.",
      "color": "#2E4057",
      "icon": "⏳"
    },
    {
      "id": "MUSE",
      "name": "Muse",
      "description": "Musical and sound-producing automata. These robots sing, whistle, blow trumpets, beat drums, play flutes, or hiss — their primary expressive channel is auditory.",
      "color": "#8B5CF6",
      "icon": "🪉"
    },
    {
      "id": "BACCHUS",
      "name": "Bacchus",
      "description": "Wine-serving, drink-dispensing, and convivial automata. These robots pour, serve, select drinkers, or simulate the social rituals of drinking and feasting.",
      "color": "#991B1B",
      "icon": "🍷"
    },
    {
      "id": "TERPSICHORE",
      "name": "Terpsichore",
      "description": "Dancing, rotating, and processional automata. These robots move through space — circling, spinning, processing, rowing, or walking — with their locomotion as the primary spectacle.",
      "color": "#D97706",
      "icon": "💃"
    },
    {
      "id": "PROMETHEUS",
      "name": "Prometheus",
      "description": "Fire-driven and heat-activated automata. These robots are powered by or respond to fire, steam, or combustion — the element of fire is essential to their operation or narrative.",
      "color": "#DC2626",
      "icon": "🔥"
    },
    {
      "id": "NEREID",
      "name": "Nereid",
      "description": "Water-pouring, washing, and hydraulic-service automata. These robots dispense water for ablution, bathing, or purification — they serve the body's cleansing needs.",
      "color": "#0EA5E9",
      "icon": "💧"
    },
    {
      "id": "SPHINX",
      "name": "Sphinx",
      "description": "Deceptive, illusory, and trick-performing automata. These robots exist to fool, deceive, or astonish — through impossible survival, fake identities, magic tricks, or paradoxical behaviors.",
      "color": "#4A1942",
      "icon": "🎭"
    },
    {
      "id": "HIEROPHANT",
      "name": "Hierophant",
      "description": "Sacred, ritual, and temple automata. These robots serve religious or ceremonial functions — performing libations, activating at altars, processing through sacred spaces, or mediating divine presence.",
      "color": "#F5F0DC",
      "icon": "🏛️"
    },
    {
      "id": "FAUNA",
      "name": "Fauna",
      "description": "Animal-form automata. These robots take the shape of birds, serpents, peacocks, elephants, dolphins, cows, or other creatures — their animal identity is central to their design and meaning.",
      "color": "#059669",
      "icon": "🦚"
    },
    {
      "id": "THOTH",
      "name": "Thoth",
      "description": "Measuring, indicating, and scribing automata. These robots point to scales, write on surfaces, display numbers, or track quantities — they are instruments of knowledge and record.",
      "color": "#1E3A5F",
      "icon": "📜"
    },
    {
      "id": "PERSONA",
      "name": "Persona",
      "description": "Human-mimicking and emotionally simulating automata. These robots imitate distinctly human behaviors — drinking, nodding, flirting, weeping, gesturing, or appearing as specific individuals. Their power lies in the uncanny simulation of personhood.",
      "color": "#BE185D",
      "icon": "👤"
    },
    {
      "id": "DRAMATURGE",
      "name": "Dramaturge",
      "description": "Narrative and theatrical automata. These robots enact stories, change scenes, perform multi-act sequences, or stage dramatic tableaux — they are storytelling machines with beginning, middle, and end.",
      "color": "#7C3AED",
      "icon": "🎪"
    },
    {
      "id": "ZEPHYR",
      "name": "Zephyr",
      "description": "Wind-sensing and air-driven automata. These robots respond to or indicate atmospheric conditions — weather vanes, pneumatic devices where compressed air is the primary motive force.",
      "color": "#94A3B8",
      "icon": "🌬️"
    },
    {
      "id": "CASCADE",
      "name": "Cascade",
      "description": "Chain-reaction and multi-trigger automata. These robots feature elaborate sequential mechanisms where one action triggers the next in a visible domino-like spectacle — the complexity of the causal chain is itself the marvel.",
      "color": "#F59E0B",
      "icon": "⚙️"
    },
    {
      "id": "UNKNOWN",
      "name": "Unknown",
      "description": "It remains a mystery.",
      "color": "#6B7280",
      "icon": "❓"
    }
  ],
  "agencyLevels": [
    {
      "level": 1,
      "stars": "★",
      "description": "Basic autonomous behavior, require human interaction."
    },
    {
      "level": 2,
      "stars": "★★",
      "description": "Partial autonomy, reactive behavior or constrained autonomy."
    },
    {
      "level": 3,
      "stars": "★★★",
      "description": "Perceived to be nearly autonomous"
    },
    {
      "level": 4,
      "stars": "★★★★",
      "description": "Perceived to have full autonomy with adaptive, or decision-capable agency."
    }
  ],
  "books": [
    {
      "id": "book-of-ingenious-devices",
      "title": "The Book of Knowledge of Ingenious Mechanical Devices",
      "author": "Ismail al-Jazari",
      "overview": "A practical 1206 engineering manual cataloging ingenious clocks, automata, fountains, and pumps with detailed construction methods."
    },
    {
      "id": "de-architectura",
      "title": "De Architectura",
      "author": "Vitruvius",
      "overview": "A ten-book Roman treatise that unifies architecture, engineering, materials, hydraulics, machines, and civic design into one system of practice."
    },
    {
      "id": "hero-of-alexandria-automata",
      "title": "Hero of Alexandria - Automata",
      "author": "Hero of Alexandria",
      "overview": "A technical guide to programmable theatrical and mobile automata that sequence motion, sound, and effects through cords, weights, and timing."
    },
    {
      "id": "hero-of-alexandria-pneumatics",
      "title": "Hero of Alexandria - Pneumatics",
      "author": "Hero of Alexandria",
      "overview": "A compendium of pneumatic and hydraulic devices showing how air, water, and heat power temple automata, trick vessels, and early steam mechanisms."
    },
    {
      "id": "liezi",
      "title": "Liezi",
      "author": "Liezi",
      "overview": "A Taoist classic of stories and paradoxes exploring spontaneity, perception, fate, and the limits of rational knowledge."
    },
    {
      "id": "ramayan-of-valmiki",
      "title": "The Rámáyan of Válmíki",
      "author": "Válmíki",
      "overview": "A Sanskrit epic recounting Rama's exile, Sita's abduction, and the war with Ravana as a meditation on duty, devotion, and kingship."
    }
  ]
}